gid распределенная система версий 
это система для отслеживание и ведение истрии изменения файлов а вашем проекте 

репазиторий - хианилише вашего кода и истории его изменений 

github веб сайт для размешение  git репозиториев в совместной разработке проекта

 
команды git
1 git init  создает новый локальный гид репазиторий у вас на пк в той директории в котрой была прописана команда команда вводиться только в начале 


2 git add - команда для добавление файлов в систему отслеживание гита, после это команды изменение начинают отслеживаться гитом.

git commit -m как только достигаем определенного момента в разрабртке то тогда мы сохраняем и коментируем ихменения в локальном репазитории

git remont add эта камадна для того то бы связать наш локальный репазиторий с удаленными репазиториями тоесть добавляет подключение к депазиторию на гидхабе
git remont add <name origin> <ссылка на peno;ssh>>

git push - комнла для отправки всех измениний на локальном репозитории на удаленный репозиторий git push origon <branch(main)

>
 git init один раз
 git add .
 git commit -m
 3ю1 git branch -M main 1 раз для переимонование ветки 
 git remote add origin <ссылка> только один раз 
 git push origin name     *
 --------------------------------------------------------------------------------------------------------------------------------------------------------------
                                               PEP 8 - руководство по написанию кода на Python
                                 https://pythonworld.ru/osnovy/pep-8-rukovodstvo-po-napisaniyu-koda-na-python.html
 

 
